{
  "common" :  {
    "colors" : {
      "rare" : [ "Red", "Blue", "Yellow", "White", "Black", "Transparent/Rainbow" ],
      "double_chance" : [ "Purple", "Orange", "Pink", "Brown", "Vermillion", "Green", "Sky blue", "Navy", "Indigo",
      "Cream", "Beige", "Gold", "Gray", "Silver", "Metallic"]
    },
    "stress_explosions" : [
      ["Alcohol/Drugs", "You drink alcohol (or drugs) until you can't remember or care."],
      ["Stealing", "You steal valuables from the mansion or from other maids."],
      ["Violence", "You unleash violence on the other maids and the master."],
      ["Gambling", "You use every penny you have for gambling."],
      ["Racing", "You get into whatever car/vehicle is handy and go for a drive at at least twice the speed limit."],
      ["Teasing", "You start persistently tormenting the other maids."],
      ["Mischief", "You start playing troublesome tricks on the master and the other maids."],
      ["Running Away", "You run away from the mansion."],
      ["Complaining", "You start incessantly complaining to the master and other maids."],
      ["Seclusion", "You go into your room and won't come out, not even for food."],
      ["Crying", "You start crying. There's no need for an Affection check for this."],
      ["Rampage", "You use anything you can lay your hands on to run around destroying things around the mansion."],
      ["Shopping", "You go crazy spending your money on shopping."],
      ["Sleep", "You spend all day sleeping."],
      ["Binge", "You go crazy eating."],
      ["Prayer", "You escape through religion, relentlessly praying to heaven for protection."],
      ["Spoiled Child", "You act like a spoiled child, making demands of the master."],
      ["Player Choice", "Let the player to your left decide for you."]
    ]
  },

  "maid" : {
    "weapons" : [
      ["Mop/Broom", "You fight with a broom or mop. This is a maid's basic fighting style."],
      ["Stun Gun", "You keep a stun gun ready to attack enemies."],
      ["Kitchen Knife", "You wield some kind of ordinary kitchen knife."],
      ["Frying Pan", "You hit things with a frying pan."],
      ["Vase/Bottle/Pot", "When trouble happens, you grab something suitable from around the mansion and wave it around or throw it."],
      ["Hand-to-Hand", "You fight with your bare hands, whether striking attacks or submission moves."],
      ["Revolver", "You fight with a revolver. Feel free to decide what kind."],
      ["Machinegun", "You wield a machinegun. Feel free to decide what kind."],
      ["Rifle", "You wield a rifle. Feel free to decide what kind."],
      ["Bomb/Grenade", "You use bombs, grenades, or maybe plastic explosives."],
      ["Bazooka", "When a fight breaks out you pull out a big-ass bazooka."],
      ["Ray Gun", "It might look like a prop of a 50s sci-fi B movie, but the ray gun you're packing really does hurt people."],
      ["Metal Pipe/Nail Bat", "You use some crude weapon like a pipe or a bat with nails in it."],
      ["Hammer", "You wield a hammer, whether a small throwing hammer, a big warhammer, or one of the squeaky toy variety."],
      ["Scythe", "You wield a big scythe worthy of the Grim Reaper."],
      ["Kung Fu Weapon", "Nunchucks, Three-Section Staff, Tonfa, Sai, Tai Chi Sword, etc."],
      ["Chainsaw", "Never mind how loud it is you fight with a chainsaw!"],
      ["Western Sword", "A long sword, rapier, flamberge, two-handed sword, etc., etc."],
      ["Wooden Sword/Staff", "You wield bokken - Japanese-style wooden sword - or a staff."],
      ["Axe/Hatchet", "A tomahawk, battle axe, halberd, etc."],
      ["Morningstar", "Basically a mace with spikes. You can have a flail instead if you like."],
      ["Whip", "A normal whip, a cat of nine tails, a metal whip, etc."],
      ["Spear/Lance", "A spear, lance, javelin, etc."],
      ["Exotic Weapon", "A boomerang, qatar, African throwing irons, etc."],
      ["Knife/Scalpel", "You attack with a knife or scalpel. You can throw it too, and it can be a large dagger if you like."],
      ["Chain/Rope", "You attack with a chain or rope."],
      ["Claws", "You attack with claws, a bagh nakh, cestus, or some other claw-like weapon."],
      ["Katana", "You wield a katana, or possibly a kusarigama or some other traditional Japanese weapon."],
      ["Shuriken/Kunai", "You have a seemingly unlimited supply of shuriken (throwing stars), or kunai (ninja throwing knives)."],
      ["Halberd/Pole Arm", "Naginata, halberd, bardiche, or some other kind of pole arm."],
      ["Summoning", "You are able to summon some kind of special being to attack. You can decide what you summon and how it attacks."],
      ["Magic", "You use magic to attack."],
      ["Psychic Powers", "Well, you have some kind of psychic/super power that you use to attack. You can decide the details."],
      ["Book", "You wield a book as a blunt instrument, and possibly tear out pages, to attack."],
      ["Internal Weapons", "You have some kind of weapons installed in your body."],
      ["Religious Symbol", "You can use a cross, prayer wheel, paper charm, or other seemingly harmless religious symbol to deliver attacks."]
    ],
    "types" : [
      ["Lolita", "Childish, young, innocent, cute, sweet.", [-1, 0, 0, 0, 1, 0], "Luck +1, Athletics -1"],
      ["Sexy", "Charming, coquettish, womanly body, glamorous.", [0, 0, 0, 1, 0, -1], "Cunning +1, Will -1"],
      ["Pure", "Pure, maidenly, clean, fragile.", [0, 1, 0, -1, 0, 0], "Affection +1, Cunning -1"],
      ["Cool", "Composed, expressionless, unflappable, doll-like.", [0, -1, 1, 0, 0, 0], "Skill +1, Affection -1"],
      ["Boyish", "Wild, energetic, vigorous, at first glance looks like a boy.", [1, 0, -1, 0, 0, 0], "Athletics +1, Skill -1"],
      ["Heroine", "Earnest, single-minded, tries her very best.", [0, 0, 0, 0, -1, 1], "Will +1, Luck -1"]
    ],
    "qualities" : [
      ["Glasses", "You wear glasses, and can't use contact lenses. The frame design can be whatever you want.", null],
      ["Freckles", "You have freckles.", null],
      ["Sickly", "You've got an incurable disease. However, this doesn't adversely affect your attributes. Choose your own symptoms.", null],
      ["Quiet", "You have a cool, subtle demeanor. No, there are no rules regarding how often you speak.", null],
      ["Easygoing", "You take things slow and calm, at your own pace. This doesn't affect your attributes.", null],
      ["Neat Freak", "You're obsessed with cleanliness, and can't let the tiniest bit of dirt go unnoticed.", null],
      ["Brown Skin", "Your skin is a dark brown color. It could be natural, or a tan.", null],
      ["Albino", "You have no pigment. You're not necessarily completely colorless, this could simply be a very pale complexion.", null],
      ["Shy", "You're very shy. Don't forget to remain silent when encountering NPCs you haven't met before.", null],
      ["Actually A Guy", "You're actually a guy (cross-dresser?). Or possibly a hermaphrodite.", null],
      ["Overactive Imagination", "You frequently get caught up in your own imaginary world, or else tend to daydream a lot.", null],
      ["Greedy", "You will do absolutely anything for the sake of money.", null],
      ["Elf Ears", "You have long, pointed ears.", null],
      ["Nekomimi", "This varies a bit depending on the setting, but you're a catgirl, with the ears and possibly tail of a cat.", null],
      ["Android/Gynoid", "You're not human, but rather a human-looking robot. Parts of your body are very obviously artificial.", null],
      ["Vampire", "You are a vampire, with long fangs. Be sure to act . . . vampiric.", null],
      ["Princess", "You're actually the daughter of a family of even greater standing than the master. Depending on the setting, you could even be from another country's royal family. Whether you are in disguise or not is up to you.", null],
      ["Angel/Devil", "You are a being from another world charged with judging good and evil. The design and the details of your origins are up to you.", null],
      ["Uniform", "You've managed to make a special arrangement with your uniform.\n>> Uniform table", [
              ["Tights", "In place of a skirt, you wear tights of some color. Athletic, colorful, sexy, or weird (leopard pattern, RAWR!) it's up to you. (For the purposes of the maid uniform rules, treat these as a skirt)"],
              ["China Dress", "You wear a Chinese-style cheongsam maid uniform. (For the purposes of the rules, treat this as a one-piece maid uniform)."],
              ["Armor", "Your maid uniform is actually a stylized suit of metal armor."],
              ["Bondage", "Your maid uniform is made of shiny rubber or leather, and generally a bit suspicious."],
              ["Miniskirt", "Your skirt is very short, to the point where one can almost see its contents."],
              ["Kappougi", "Instead of a Western maid uniform, you wear a Japanese-style one with a kimono and an apron over it."]
        ]
      ],
      ["Symbol", "You have some kind of special mark on your uniform of headdress.\n>> Symbol table", [
              ["Skull", "Your headdress, apron, necktie, forehead, or chest has a skull mark."],
              ["Bat", "Your headdress, apron, necktie, forehead, or chest has a bat symbol."],
              ["Cross", "Your headdress, apron, necktie, forehead, or chest has a cross on it."],
              ["Yin-Yang", "Your headdress, apron, necktie, forehead, or chest has a yin-yang symbol."],
              ["Star", "Your headdress, apron, necktie, forehead, or chest has a five- or six-pointed star mark."],
              ["Card suit", "Your headdress, apron, necktie, forehead, or chest has is marked with one of the four suits from playing cards: hearts, diamonds, clubs or spades."]
        ]
      ],
      ["Delinquent", "Something about you is very much like a delinquent.\n>> Delinquent table", [
              ["Cigarettes", "You've always got a cigarette in your mouth, or are chomping on a cigar."],
              ["Tattoo", "Somewhere on your body - or maybe even all over it - you have a tattoo."],
              ["Sunglasses", "You always wear sunglasses or mirrorshades. Even at night."],
              ["Bad Expression", "You have a perpetual unpleasant facial expression (as if you're always angry, or always about to kick ass at any moment), and this makes first meetings difficult."],
              ["Piercings", "You have piercings, and not just in your ears, but perhaps your forehead, lips, eyelids, chin, etc."],
              ["Rough Speak", "You talk like a gangster, be it a Mafioso or a street ganger."]
        ]
      ],
      ["Accent", "You have an unusual way of speaking.\n>> Accent table", [
              ["Southern", "Y'all talk like some kinda' country bumpkin or somethin', from down in the American South."],
              ["British", "You talk with a British accent of some kind. We'll leave it up to you what kind specifically. If you are already from the UK in real life, then you are now DOUBLE BRITISH. Or choose Scottish or Welsh."],
              ["Pidgin English", "You come from a country/society where English is taught as a pidgin language. You might sound like a Japanese salaryman or pop idol ('Body Feels Exit!'). Pick a country and go with it."],
              ["Meow", "You like to sprinkle cat sounds in your speech every now and then."],
              ["Knight", "You sound like a knight from a movie, or possibly a Renaissance Faire reject. Remember to say 'Thou art' and whatnot a lot."],
              ["Foreigner", "Pick a foreign nationality for your Maid other than Japanese. American (Brooklyn, Texas), French, Russian, Mexican, Nigerian, Indian, Canadian, etc."]
        ]
      ],
      ["Hairstyle", "You have a special hairstyle.\n>> Hairstyle table", [
              ["Long Ringlets", "Your hair is done up in large, long ringlets."],
              ["Dumplings", "Your hair is long, with 'dumplings' on top."],
              ["Mesh", "You have a mesh haircut, a short, stylish hairdo that's trendy in Japan."],
              ["Curly Hair", "Your hair is curly enough to defy gravity, and always takes the same shape."],
              ["One Eye Hair", "Your hair hangs down so that it conceals one of your eyes."],
              ["Antenna Hair", "Your hair has antennas/feelers and a mind of its own."]
        ]
      ],
      ["Accessory", "You have a special accessory attached to your uniform.\n>> Accessory table", [
              ["Collar", "Your hair has antennas/feelers and a mind of its own."],
              ["Large Ribbon", "You wear a large ribbon in your hair."],
              ["Spike", "Your maid uniform has spikes attached to it."],
              ["Chains", "Your maid uniform has jangling chains attached to it."],
              ["Black Leather Gloves", "You normally wear black leather gloves. These can be fingerless or have rivets if you like."],
              ["Pet", "You have a cat, snake, raven, or some other small animal as a pet that rests on your shoulder or in your hand."]
        ]
      ],
      ["Relationship or Perversion", "Lighter Game? You have a relationship to another player character (Maid).\n>> Relationship table\nDarker Game? You have a bizarre perversion of some kind.\n>> Perversion table", [
              ["Sibling or Nymphomaniac", "You're related by blood to one of the other characters.\nor\nYou're abnormally interested in physical love. It's up to the players and GM to decide how far you want to, or should, roleplay this."],
              ["Childhood Friends or Sadist", "You grew up together in the same neighborhood as one of the other characters, and have been great friends since a very early age.\nor\nYou're excited by causing pain and suffering to others."],
              ["Mentor or Masochist", "You look upon one of the characters as a personal mentor, perhaps even as a father/mother figure\nor\nYou're excited by being caused pain and suffering by others."],
              ["Friendly Rival or Womanizer", "You and another character are rivals in some area of life, and you always find yourself both consciously or subconsciously competing with, and comparing yourself with, that person. However, you are still friends (at least in appearance).\nor\nYou're only romantically attracted to members of the same sex, which is fine (and perhaps expected)... But in your case, it's turned up to '11'."],
              ["Ex-Lover/Love Rival or Likes Them Young", "You used to date another character. Perhaps there are still feelings. Alternately, you both might be seeking the love of a third person.\nor\nYou're only interested in . . . younger partners. You can decide what age range this entails."],
              ["Vengeance or Exhibitionist", "Another character wronged you in some way in the past. She may not even realize that she did (and it might not have seemed a big deal). But you will never forget.\nor\nYou enjoy showing off your nude or semi/nude body. 'Inappropriate dress' is not just a word, it's a way of life."]
        ]
      ],
      ["Criminal Tendencies", "You have an inclination towards criminal acts.", [
              ["Killer", "You have a bad habit: killing people."],
              ["Pyromaniac", "You love setting fires. You might even set fire to the mansion . . ."],
              ["Kleptomaniac", "You can't help but steal things, regardless of whether or not you have any use for them."],
              ["Addict", "Whether it's narcotics, stimulants, or just sleeping pills, you're a substance-abuser. If you don't get to have any, you'll experience withdrawal symptoms."],
              ["Otaku", "You have some obsession that you tirelessly pursue, with little or no regard for common sense."],
              ["Stalker", "You're stalking a particular person. Select the target from among the other PCs or the master."]
        ]
      ],
      ["Injury", "Because of mistreatment or an accident, you have some kind of permanent physical injury.\n>> Injury table", [
              ["Patchwork", "Your body is covered with stitching scars."],
              ["One Eye", "You have only one eye. You're free to decide whether you wear an eye patch, and if so its design."],
              ["Burns", "Your face, body, etc. are covered with painful-looking scars from burns."],
              ["Whip Scars", "Your back and such is covered with painful-looking welts from whippings you received (and may possibly be still receiving?)"],
              ["Bandages", "You wear many bandages and casts, concealing injuries that will not heal."],
              ["Blind", "You were rendered blind a long time ago. (No particular penalties for this: See the classic Zatoichi movies for reference)."]
        ]
      ],
      ["Tragic Love", "You have had sad or tragic experiences with love.\n>> Tragic love table", [
              ["Separations", "For some reason love just never works out for you. At this point you've resigned yourself to fate."],
              ["Lover Died", "You had a lover who died since then you've been afraid to fall in love."],
              ["Killed Your Lover", "For whatever reason, you killed your last lover since then you've been afraid to fall in love. Or afraid for the object of your desire."],
              ["Former Prostitute", "You used to sell your body, for cheap. A complex remains."],
              ["Betrayal", "You were once betrayed by a lover since then you've been afraid to fall in love or let your guard down."],
              ["Stalker Damage", "You were once victimized by a stalker. You can't trust members of the opposite sex . . . or maybe the same sex."]
        ]
      ],
      ["Dark Past", "There is something dark in your personal history.\n>> Dark past table", [
              ["Former Delinquent", "Although no one would know it looking at you now, you used to be a delinquent. Fortunately right now there's no one (in the mansion at least) who knows about your past."],
              ["Former Killer", "You were once a hired killer. Even now, your skills have not been dulled."],
              ["Amnesiac", "You've lost your memories from when you were very young. (The GM should come up with something to reveal during the game)."],
              ["Bad Reputation", "You were involved with some bad stuff back in the day, and you have the dubious honor of being a legend for all the wrong reasons."],
              ["Wanted", "The police want to question you about a serious crime. The player can decide whether or not the character is actually guilty."],
              ["Runaway", "You've left your real home without permission."]
        ]
      ],
      ["Trauma", "After some terrible incident, you were traumatized.\n>> Trauma table", [
              ["Suicide Attempts", "In the past, you attempted suicide many times."],
              ["Killed Your Parents", "For whatever reason, you are responsible for the death of your parents."],
              ["Saw Parent Die", "You witnessed your parents' (one or both) death with your own eyes."],
              ["Sibling Hate", "You and your sister(s) detest each other."],
              ["Family Breakup", "For some reason (economic trouble?) your family was forced to break up. You may have even caused it."],
              ["Abusive Parents", "You were raised by abusive parents."]
        ]
      ],
      ["Secret Job", "You're not just a maid: you're secretly holding another job.\n>> Secret job table", [
              ["Assassin", "While you put on the facade of being a maid, underneath you're a coldhearted killer for hire."],
              ["Hacker", "Aside from being a maid, you're a hacker, breaking into computer systems."],
              ["Scientist", "Along with being a maid, you're some kind of mad scientist."],
              ["Doctor/Pharmacist", "In addition to being a maid, you have the skills of a doctor or a pharmacist."],
              ["Doujin Artist", "In addition to being a maid, you create doujinshi in your spare time. You can decide the genre."],
              ["Pro Creator", "Along with being a maid, you're working as a professional creator, craftsperson or artist. You can decide the form and genre of your works."]
        ]
      ],
      ["Membership", "In addition to being a maid, you're also a member of a certain organization.\n>> Membership table", [
              ["Evil Secret Society", "You're a member of an evil secret society that seeks to conquer or destroy the world."],
              ["Secret Agency", "You're part of a secret agency under the government or the United Nations, some sort of intelligence agent or spy."],
              ["Cult", "You're a member of some kind of eccentric cult, whether as a believer, a leader, or even the founder."],
              ["Political Organization", "You're part of a group organized around some kind of political ideal, possibly something extreme to the point of insanity."],
              ["Shadow Clan", "You're a member of one of the secret organizations that has existed throughout history. You could be a ninja, a magician, one of the knights templar, a kung fu assassin, etc."],
              ["Government Official", "You're actually a government official who is working as a maid, whether because you're a nurse, a detective going undercover, or a politician's secretary."]
        ]
      ],
      ["Shapeshifter", "You are an animal or weapon that has taken the form of a maid.\n>> Shapeshifter table", [
              ["Fox", "You're actually a fox, and can display or hide your ears and tail at will."],
              ["Spider", "You're actually a spider, and you can become an actual human-sized spider, or else just grow up to six extra arms at will."],
              ["Raven", "You're actually a raven. You have black wings that can be displayed or hidden."],
              ["Bunny", "You're actually a bunny, with bunny ears and a tail."],
              ["Tiger/Lion", "You're actually a predatory cat, and you have ears, a tail, claws, and sharp teeth than you can display or hide at will."],
              ["Snake", "You're actually a snake, and you can take on a naga form, turning the lower half of your body into a snake tail."]
        ]
      ],
      ["Monster", "You're not human, but rather some kind of monster.\n>> Monster table", [
              ["Mermaid", "You're actually a mermaid. You love water, and your ears sometimes look like fins."],
              ["Zombie/Mummy", "You're actually an animated corpse. Your complexion is probably bad, and you have conspicuous wounds."],
              ["Werewolf", "You're actually a werewolf (or maybe a weretiger). Whether or not you want to, you turn into a wolf (or tiger) during a full moon."],
              ["Succubus", "You're actually a succubus, a female demon that traps her prey by arousing their desires. You have some demonic physical traits (you decide the specifics) that can be displayed or hidden."],
              ["Ghost", "You're actually a ghost. You might have been one of the master's ancestors, or perhaps a maid who worked at the mansion in the past."],
              ["Shinigami", "You're actually a shinigami, a death reaper. As such, you carry with you an aura of death. You might be there to deliver a specific person to the other side, or perhaps your reasons are more mundane."]
        ]
      ],
      ["Magic", "You can use some kind of magical power.\n>> Magic table", [
              ["Priestess", "You can use magic grounded in some kind of religious ceremony. You must use various types of religious symbols to do so."],
              ["Onmyouji", "You practice Eastern-style magic based on Taoist principles. Your key item for this is jufu, special curse charms written in brush ink on strips of paper."],
              ["Fortuneteller", "Within certain limits, you have the ability to predict the future. There are countless methods of divination."],
              ["Western Magician", "You practice alchemy, Kabbalah, or some other form of Western sorcery. As such, you are a staffwielding orthodox magician."],
              ["Devil Summoner", "You know the spells necessary to summon demons. Your tools of the trade are magic circles, a black cloak, and ancient books."],
              ["Necromancer", "You wield magic that lets you control the souls and bodies of the dead. Your tools of the trade include skulls and black clothes."]
        ]
      ],
      ["Absurd", "You're something that flies in the face of common sense.\n>> Absurd table", [
              ["Alien", "You're an alien who came to our world from somewhere in outer space. Your body can have some special properties if you wish."],
              ["Cyborg", "You were turned into a cyborg by an evil secret society or some other country. Your body can have some special features if you wish."],
              ["Runaway Ninja", "You ran away from your ninja village."],
              ["Magical Girl", "You came from a land of magic in order to train."],
              ["Fairy", "You're one of the fae folk. You can be a generic pixie, or something more specific."],
              ["Mutant", "You've suffered some kind of strange mutation."]
        ]
      ]
    ],
    "powers" : [
      [
        ["Super Evasion", "In exchange for 1d6 Stress, you can completely avoid a single attack."],
        ["Iron Wall", "You can use your Athletics attribute to defend up to two other characters."],
        ["Trespass", "You can take 1d6 Stress to intrude on a battle, love scene, etc. You can also butt in after the action has ended, and this can even work when someone is using World For Two."],
        ["Weapon From Nowhere", "You can pull your weapon out seemingly from nowhere, and get in a surprise attack. If you make a surprise attack, you get to make an attack roll without the target getting to make an opposed roll."],
        ["Giant Weapon", "You can attack with a giant weapon. (+1 to Athletics for attacking)."],
        ["Ultimate Retort", "You can blow off an opponent completely by delivering a good retort (GM decides). You can make it impossible to defend against this by taking 2 Stress. (This must be role-played)."]
      ],
      [
        ["Maiden's Tears", "By taking 2D6 Stress, you can make a request that can't be refused. (This must be role-played)."],
        ["World for Two", "By taking 1D6 Stress, you can create a 'world' for you and one other person, where for 5 minutes no one else can intrude"],
        ["Power of Friendship", "You can take 1D6 Stress in order to remove 2D6 Stress from someone else."],
        ["Cooked With Love", "When someone eats food you've prepared, they lose 1D6 Stress."],
        ["Windows of the Soul", "You understand the master's feelings better than anyone, and can offer careful help. (Add 2 to Favor gained)."],
        ["Passionate Gaze", "With just a glance, you can ingratiate yourself with the master, taking 1D6 Stress to gain 1D3 Favor."]
      ],
      [
        ["Lock Picking", "You can enter any room whenever you feel like. This works even when someone is using World for Two."],
        ["Stalking", "When you're following someone, there's no chance for them to detect you. Don't even bother rolling dice."],
        ["Lie Detector", "By taking 1 Stress you can make other players or the master admit if they've lied."],
        ["Ultimate Menu", "Add +1 to your Skill for the purposes of cooking."],
        ["Instant Cleaning", "Add +1 to your Skill for the purposes of doing cleaning."],
        ["4-D Dress", "You can produce anything in the mansion from within your maid uniform."]
      ],
      [
        ["Punishment", "When other maids make mistakes, you can gain the right to punish them, without them having a chance to make an opposed roll."],
        ["Instant Restraint", "If you win a roll of Cunning Vs. Athletics, you can restrain someone from doing something indecent."],
        ["Coercion", "If you win a roll of Cunning Vs. Athletics, you can completely damage or tear off someone's clothes, even 'accidentally'."],
        ["Trap", "Even if you aren't there at the time, you can have a trap prepared in advance during a battle."],
        ["Fake Crying", "You can use fake frying to use your Cunning for what would normally be an Affection roll. (This must be role-played)."],
        ["Mockery", "When someone is taking Stress points, you can mock them and cause them to gain an additional 2 Stress points. (This must be roleplayed)."]
      ],
      [
        ["Karma", "You can use your Luck to dodge an attack, and if you roll a 10 or higher you cause twice as much Stress to the opponent."],
        ["Saw It", "You can declare that you've seen something happening in the mansion; you can decide the timing too."],
        ["Teleport", "You can go just about anywhere in the mansion instantly."],
        ["Escape", "You can completely flee from a battle without taking any Stress."],
        ["Foreboding", "You can tell when something dangerous is coming."],
        ["Chance Meeting", "By taking 2 points of Stress, you can have an NPC that's just showing up for the first time be an acquaintance from some time before."]
      ],
      [
        ["Immune to Pain", "During a battle, even if you're sent flying, you don't take any Stress. Outside of battle, however, you can still take Stress points like usual."],
        ["Crisis Adrenaline", "You can spend 1D6 points of Favor to add an Athletics roll to your Stress. You cannot use this to deliberately avoid the natural removal of Stress points."],
        ["Persistence", "Whenever you take Stress, automatically reduce the amount by 1"],
        ["Tenacity", "Even after being defeated in battle, you can take 2 Stress to get to your feet."],
        ["Hard Work", "Your relentless hard work pays off in the form of a +3 bonus to the end result (not the attribute or die roll) of Skill rolls."],
        ["Absolute Maid", "You are the very epitome of a maid, and you take no penalties when not in full uniform."]
      ]
    ],
    "roots": [
      ["Debts", "Your family wound up with massive debts, and you found yourself coming to work at the mansion as repayment."],
      ["Slave", "You are a slave, and have no choice about your line of work."],
      ["Mistress", "Although you appear to be a maid, it would be more accurate to call you the master's lover."],
      ["Revenge", "The master is your hated enemy, and you are infiltrating his mansion in order to extract revenge."],
      ["Orphan", "You are an orphan adopted by the master or his parents."],
      ["Illegitimate Child", "You are an illegitimate child. From a legal standpoint you're no different from the master."],
      ["Hereditary Maid", "You were born into a family that has served the mansion for generations."],
      ["Self Punishment", "In order to punish yourself for your inexperience or sins, you have taken up the job of a maid."],
      ["Unrequited Love", "Following your one-sided love of the master, you have come here."],
      ["Business", "You are a maid because you want the wages. And that's about it."],
      ["Infiltrator", "You are a member of an organization that opposes the master, and you have been sent to spy on or possibly even assassinate him."],
      ["Loyalty", "You feel great loyalty to the master."],
      ["Childhood Friend", "As the master's childhood friend, you've used your influence to get here."],
      ["Admirer of Maids", "You have long admired maids, and through much hard work you've finally become one yourself."],
      ["Returning a Favor", "The master did a great service to you, and you have become a maid in order to repay him."],
      ["Distant Relative", "Although you are only distantly related to the master, your parents have put you in his care."],
      ["Bridal Training", "You became a maid in order to prepare yourself to become an ideal bride some day."],
      ["Who Knows?", "You're really not quite sure how you wound up becoming a maid."]
    ]
  },

  "butler" : {
    "colors" : {
      "suit" : ["Black", "Light Gray", "Dark Gray", "Dark Blue", "White"],
      "hair" : ["Black", "Gray", "Blonde", "Silver", "White"]
    },
    "weapons" : [
      ["Striking Martial Arts", "You use Karate, Boxing, Muay Thai, Kung Fu, Capoeira or some other striking martial art to attack."],
      ["Grappling Martial Arts", "You use Jujutsu, Aikido, Judo, or some other grappling/joint locking martial art to attack."],
      ["Security", "You can use the traps and other security devices installed all throughout the mansion to attack."],
      ["Tank", "You use your favorite tank to blast or run over your enemies."],
      ["Combat Helicopter", "You use your favorite combat helicopter to shoot or bombard your enemies."],
      ["Torture Implements", "Torture implements that are awful just to look at. Fingernail pullers, the iron maiden, finger crushers, etc."],
      ["Handgun", "A revolver, derringer, automatic pistol, or other handgun."],
      ["Machinegun", "A machinegun that can throw out a rain of bullets in a short period of time."],
      ["Rifle", "An assault rifle, shotgun, musket, etc."],
      ["Bomb/Grenade", "You use bombs, grenades, or maybe plastic explosives."],
      ["Bazooka", "When a fight breaks out you pull out a big-ass bazooka."],
      ["Ray Gun", "It might look like a prop of a 50s sci-fi B movie, but the ray gun you're packing really does hurt people."],
      ["Devil Power", "Your physical body, fused with a demon, is a weapon in itself. You use this overwhelming, superhuman power to crush your foes. How it works exactly is up to you."],
      ["Hammer", "You wield a hammer, whether a small throwing hammer, a big warhammer, or one of the squeaky toy variety."],
      ["Scythe", "You wield a big scythe worthy of the Grim Reaper."],
      ["Kung Fu Weapon", "Nunchucks, Three-Section Staff, Tonfa, Sai, Tai Chi Sword, etc."],
      ["Chainsaw", "Never mind how loud it is you fight with a chainsaw!"],
      ["Wooden Sword/Staff", "You wield bokken - Japanese-style wooden sword - or a staff."],
      ["Axe/Hatchet", "A tomahawk, battle axe, halberd, etc."],
      ["Morningstar", "Basically a mace with spikes. You can have a flail instead if you like."],
      ["Western Sword", "A long sword, rapier, flamberge, two-handed sword, etc., etc."],
      ["Whip", "A normal whip, a cat of nine tails, a metal whip, etc."],
      ["Spear/Lance", "A spear, lance, javelin, etc."],
      ["Exotic Weapon", "A boomerang, qatar, African throwing irons, etc."],
      ["Knife/Scalpel", "You attack with a knife or scalpel. You can throw it too, and it can be a large dagger if you like."],
      ["Chain/Rope", "You attack with a chain or rope."],
      ["Claws", "You attack with claws, a bagh nakh, cestus, or some other claw-like weapon."],
      ["Katana", "You wield a katana, or possibly a kusarigama or some other traditional Japanese weapon."],
      ["Beam Attack", "You can fire a destructive beam of light, heat, cold, or electricity from your hands or eyes. This is not a power possessed by human beings."],
      ["Fire", "You can spew fire from your hands or mouth. This makes it kind of hard to believe that you're human."],
      ["Summoning", "You are able to summon some kind of special being to attack. You can decide what you summon and how it attacks."],
      ["Magic", "You use magic to attack. Or at least something that we might as well call magic."],
      ["Psychic Powers", "Well, you have some kind of psychic/super power that you use to attack. You can decide the details."],
      ["Book", "You wield a book as a blunt instrument, and possibly tear out pages, to attack."],
      ["Internal Weapons", "You have some kind of weapons installed in your body."],
      ["Religious Symbol", "You can use a cross, prayer wheel, paper charm, or other seemingly harmless religious symbol to deliver attacks."]
    ],
    "types" : [
      ["Shadow", "Ninja, Phantom, Escort, Surveillance Expert, Enforcer", [1, 0, 0, 0, 0, 0], "Athletics +1"],
      ["Elite", "Expert, Right-Hand Man, Trusted Friend, Cynic, Inspector, Wicked Tongue", [0, 0, 0, 1, 0, 0], "Cunning +1"],
      ["Monster", "Inhuman Strength, Unworldly, Monster, Beast", [1, 0, 0, 0, 0, 0], "Athletics +1"],
      ["Partner", "Companion, Friend, Adviser, Unbreakable Bond", [0, 1, 0, 0, 0, 0], "Affection +1"],
      ["Gothic", "Servant, Austere, Mechanical, Educator, Manager", [0, 0, 1, 0, 0, 0], "Skill +1"],
      ["Veteran", "Expert, Old Hand, Coach, All-Purpose", [0, 0, 0, 0, 0, 0], "Any One Attribute +1\n(Raise this attribute manually!)"]
    ],
    "qualities" : [
      ["Glasses", "You wear glasses, and can't use contact lenses. The frame design can be whatever you want, and this can include a monocle."],
      ["Sunglasses", "You always wear sunglasses or mirrorshades. As a rule, you don't take these off."],
      ["Furrowed Brows", "Your brows are always furrowed, like you're in a bad mood."],
      ["Quiet", "Strangely different from the 'Cool' Maid Type. No, there are no rules regarding how often you speak."],
      ["My Pace", "You like to live life at your own particular tempo, and you're always calm and laid-back. This does not affect your attributes."],
      ["Shibui", "Most butlers are well-kept and affable gentleman. But you are beyond that. Think Sean Connery on his best days."],
      ["Brown Skin", "Your skin is a dark brown color, either naturally or because of tanning."],
      ["Narrow Eyes", "You have narrow eyes. They make it look like you're smiling. What you're really feeling is another matter entirely."],
      ["Knight Talk", "You speak like a knight of old, saying 'thou art' and such a lot."],
      ["A Woman", "You're actually a woman dressed as a man. Or you could be a hermaphrodite or something. You may roll for your other Special Qualities on the maids' Special Quality table if you wish."],
      ["Giant", "You're huge, more than two meters tall."],
      ["Muscular", "Your body is like a work of art, shrouded as it is in an armor of muscle."],
      ["Attractive", "One or more of the maids finds you attractive, if a little unapproachable because of your position."],
      ["Misshapen Body", "Some part of your body has suffered damage or is otherwise abnormal. You might have one arm, a strangely bent arm, or otherwise be misshapen."],
      ["Android", "You're not human, but rather a human-looking robot. Parts of your body are very obviously artificial."],
      ["Vampire", "You are a vampire, with long fangs. Be sure to act... vampiric."],
      ["White Eyes", "Your eyes are almost completely white and have no pupils. Or, your eyes might always be glowing."],
      ["Emaciated", "You have long, thin limbs and an emaciated body. Your figure reminds people of a spider or a wire frame."],
      ["Bishonen", "Not only are you attractive, but women - and men - adore you. There's a good chance that you're also romantically attracted to members of the same sex."],
      ["Sadist", "You're excited by causing pain and suffering to others."],
      ["Sibling", "You have a relationship with one of the other Maids: You are siblings."],
      ["Sportsman", "Pick a sport. You are a legend at playing it. The more elegant the sport, the better (fencing, polo, cricket, etc)"],
      ["Patchwork", "Your body is covered with stitching scars."],
      ["One Eye", "You have only one eye. You're free to decide whether you wear an eye patch, and if so its design."],
      ["Burns", "Your face, body, etc. are covered with painful-looking scars from burns."],
      ["Masochist", "You're excited by being caused pain and suffering by others."],
      ["Former Mercenary", "You were once a mercenary, constantly moving from battlefield to battlefield. You haven't forgotten any of your experiences or instincts from that time."],
      ["Amnesiac", "You've lost your memories from when you were very young. (The GM should come up with something to reveal during the game)."],
      ["Wanted", "The police want to question you about a serious crime. The player can decide whether the character is actually guilty."],
      ["Secretly an Assassin", "While you put on the facade of being a butler, underneath you're a coldhearted killer on the side."],
      ["Hacker", "Aside from being a butler, you're a hacker, breaking into computer systems."],
      ["Doctor", "In addition to being a butler, you have the skills of a doctor or a pharmacist."],
      ["Shadow Clan", "You're a member of one of the secret organizations that has existed throughout history. You could be a ninja, a magician, one of the knights templar, a kung fu assassin, etc."],
      ["Mummy", "You're actually an animated corpse. Your complexion is bad, and you have conspicuous wounds."],
      ["Priest", "You can use magic grounded in some kind of religious ceremony. You must use various types of religious symbols to do so."],
      ["Cyborg", "You were made into a cyborg by an evil secret society or another country. You can have some special features if you wish."]
    ],
    "powers" : [
      [
        ["Super Evasion", "In exchange for 1d6 Stress, you can completely avoid a single attack."],
        ["Lock Picking", "You can enter any room whenever you feel like. This works even when someone is using World for Two."],
        ["Stalking", "When you're following someone, they won't spot you at all. (No roll possible)."],
        ["Surprise Attack", "In a flash you can bring out a weapon and deliver an attack. (Add +10 to the result for the first attack during combat, using a weapon)."],
        ["Saw It", "You can declare that you've seen something happening in the mansion; you can decide the timing too."],
        ["Now You See Him...", "You don't need to actually move around the mansion to get where you need to be, as you can simply appear where you like within the house."]
      ],
      [
        ["Support", "By spending 1D6 Favor, you can modify someone else's die roll by +1 or -1."],
        ["Intrigue", "This butler can make rolls to resist the actions of maids, but only when the Master isn't there to see."],
        ["Knowing Laugh", "When the maids cause disruptions during your work (not including Seduction rolls), you can automatically succeed at ignoring them."],
        ["Insight", "With nothing more than an intent look you can make someone of the opposite sex (or maybe the same sex) feel enough feelings of love that they won't choose to attack."],
        ["Trap", "Even if you aren't there at the time, you can have a trap prepared in advance during a battle."],
        ["Futile", "You can prevent an opponent from using any special powers or Favor points they might possess."]
      ],
      [
        ["Person Inside", "You actually have a maid inside of you somehow. You have the option of re-creating your character as a maid and participating in the game that way whenever you wish."],
        ["Fighting Spirit", "You have a powerful aura that extends for about 5 meters in every direction, and this gives you a bonus of +1 to die rolls for fighting any non-butler opponents."],
        ["Eerie", "Because of your eerie appearance and atmosphere, you can apply a -1 penalty to rolls made to resist you by members of the opposite sex."],
        ["Limiter", "Usable for attacks made using Athletics. You can make two attacks against opponents within your field of vision, but you take 10 Stress for each attack."],
        ["Giant Weapon", "You can attack with a giant weapon. (+1 to Athletics for attacking)."],
        ["Berserker", "When making an attack using Athletics, you can opt to an all-out attack that encompasses friends and foes alike, and adds +1 to the die roll."]
      ],
      [
        ["Backup", "When a maid has failed and is about to lose Favor points, you can back her up and prevent her from losing Favor."],
        ["World for Two", "By taking 1D6 Stress, you can create a 'world' for you and one other person, where for 5 minutes no one else can intrude."],
        ["Twisted Love", "Because of your twisted love for the Master, every time you gain Favor from the Master, you also reduce your Stress by the same amount."],
        ["Deep Trust", "Because of your deep bond of trust with the Master, each time you gain Favor from the Master you receive an additional 2 Favor."],
        ["Bonds of the Heart", "You understand the Master's feelings better than anyone, and as such you can give him sensible assistance (+2 points of Favor gained)."],
        ["Two As One", "When the Master is in danger or has taken Stress, you can take the Stress yourself and instantly arrive at his location."]
      ],
      [
        ["Punishment", "When maids make mistakes, you can gain the right to punish them, without them having a chance to make an opposed roll."],
        ["Lie Detector", "By taking 1 Stress you can make other players or the master admit if they've lied."],
        ["Old Hand", "Whether a Special Quality or a weapon, you can declare that you're conversant in skills that you haven't been shown to possess before."],
        ["As Expected", "You can spend 2 points of Favor to automatically succeed at resisting with Luck. (Treat this as getting the same result as the opponent)."],
        ["Foreboding", "You can act as though you had knowledge of impending danger (especially Random Events) before the fact."],
        ["Consequences", "You can spend 3 Favor to re-roll the die for any action you take."]
      ],
      [
        ["Invincible", "You take no Stress from attacks made with Attributes of 2 or less."],
        ["Crisis Adrenaline", "You can spend 1D6 points of Favor to add an Athletics roll to your Stress. You cannot use this to deliberately avoid the natural removal of Stress points."],
        ["Connections", "You have whatever kinds of special connections you want. You can request the assistance of other groups or organizations from outside of the mansion."],
        ["Chance Meeting", "By taking 2 points of Stress, you can have an NPC who just appeared be someone you knew previously, and decide the nature of that relationship."],
        ["Manly Tears", "By taking 2D6 Stress, you can make requests of others (PCs or NPCs). This must be role-played."],
        ["Meatshield", "You can shield others, taking the Stress points that would've been applied to up to two others within your field of vision."]
      ]
    ],
    "roots" : [
      ["Hatred", "His dark hatred will not be satisfied by mere violence, and he lies in wait to bring true despair to bear."],
      ["Ambition", "His desire stirs him. He conceals your sharp fangs beneath a mask of subservience, until the day when he's ready to take everything that belongs to the Master."],
      ["Contract", "He works in the mansion simply as part of a clear-cut employment contract. At the very least, the pay isn't bad."],
      ["Affection", "He feels deep affection for the Master, the maids, and even the mansion itself. He sees them as difficult children he loves so much he can't help but tend to them."],
      ["Loyalty", "He serves the mansion as a shield, and his loyalty is absolute. He will do anything for the master of the house, even at the cost of his own life."],
      ["Family", "He can be thought of as the Master's family. They both need each other, and the division between Master and servant is not so obvious."]
    ]
  },

  "master" : {
    "types" : [
      ["Small Child", "The Master is a small child. At this age most know nothing of the outside world and have no trace of suspicion.", "2D6"],
      ["Legitimate Child", "The Master is still a child. He's just starting to understand his power.", "5+2D6"],
      ["Layman", "The Master is an ordinary person who came into wealth by chance.", "8+2D6"],
      ["Natural Born", "The Master is a young man or woman, and probably learned certain things wrong and has some twisted ideas.", "12+2D6"],
      ["Aristocrat", "This person was born to be the master of the house. Regardless of age, he has excellent self-control.", "1D66"],
      ["Recluse", "The Master has already put an end to his dealings with the outside world, and adopted a secluded lifestyle.", "1D66+10"]
    ],
    "qualities" : [
      ["Glasses", "You wear glasses, and can't use contact lenses. The frame design can be whatever you want, and this can include a monocle."],
      ["Sickly", "You've got an incurable disease. However, this doesn't adversely affect your attributes."],
      ["Royalty", "You're among the heads of a country or organization, and as a result your life is often put in danger."],
      ["Quiet", "Strangely different from the 'Cool'', Maid Type. No, there are no rules regarding how often you speak."],
      ["My Pace", "You like to live life at your own particular tempo, and you're always calm and laid-back. This does not affect your attributes."],
      ["OCD", "You're obsessed with hygiene management. You can't let the slighted bit of dirt pass."],
      ["Brown Skin", "Your skin is a dark brown color, either naturally or because of tanning."],
      ["Albino", "You have no pigment. You're not necessarily completely colorless, and this can simply be a very pale complexion."],
      ["Shy", "You're very shy. Don't forget to remain silent when encountering NPCs you haven't met before."],
      ["Cross-Dresser", "You outwardly appear to be of the opposite sex, which gives you a kind of perverse allure."],
      ["Imagination", "You frequently get caught up in your own imaginary world."],
      ["Hermaphrodite", "You're both male and female. The player can decide which is the base sex."],
      ["Bishounen/Bishoujo", "Not only are you attractive, but women - and men - adore you. There's a good chance that you're also romantically attracted to members of the same sex."],
      ["Noble Hair", "Your hair is done up in long rolls, your beard is very aristocratic, or you otherwise have hair that your position amongst nobility. clear"],
      ["Hedonist", "You only care about being able to passively enjoy life, or to put it nicely, you have no prejudices to speak of."],
      ["Vampire", "You are a vampire, with long fangs. Be sure to act... vampiric."],
      ["Otaku", "You have some obsession that you tirelessly pursue, with little or no regard for common sense."],
      ["Angel/Devil", "You are a being from another world charged with judging good and evil. The design and the details of your origins are up to you."],
      ["Lecherous", "Sexual harassment isn't just a crime, it's a way of life."],
      ["Sadist", "You're excited by causing pain and suffering to others."],
      ["Masochist", "You're excited by being caused pain and suffering by others."],
      ["Handicapped", "You can only move around on your own with a wheelchair, or you might even outright be confined to your bed."],
      ["Scars", "Your face, back, etc. are covered with painful-looking scars."],
      ["Kidnapped", "You were once kidnapped and held for 1D6 days. Even today it remains a scar in your heart."],
      ["Capable Sibling", "You have a sibling who excels at seemingly everything. You're tormented by an inferiority complex."],
      ["Family Hate", "You despise one or more of your parents or siblings. The GM can decide what if anything happened in the past."],
      ["Professional Criminal", "You're a professional criminal, and most of your assets no doubt came from ill-gotten gains."],
      ["Amnesiac", "You've lost your memories from when you were very young. (The GM should come up with something to reveal during the game)."],
      ["Artist", "You are a musician, painter, writer, actor, singer, composer, or some other kind of highly talented artist."],
      ["Evil Emperor", "You are the leader of an evil kingdom or secret society, or the leader of a group aimed at tearing down society."],
      ["Undead", "Despite your rotting body, you live on. This can be a mummy, zombie, lich, etc."],
      ["Scientist", "You are a scientist who freely commands advanced technology, and who dabbled in countless fields."],
      ["Oracle", "You can predict the future to a certain degree. There are any number of possible ways this can be carried out, and the player is free to define how their character does so."],
      ["Magician", "You wield sorcerous powers, in the matter of a typical fantasy wizard."],
      ["Priest", "You are a priest of some religion or other."],
      ["Maid Quality", "Roll 1D66 and re-roll the tens digit if it's less than 4, so you get a result from 41-66 from the Maid Special Quality table.\n>> Maid quality table"]
    ],
    "powers" : [
      ["None", "You don't seem to have any power at all. (During the game, the player can roll 2D6 and replace 'None' with some other Power Source)."],
      ["Fear", "You are a tyrannical despot who rules by fear, or you have channels through the underworld. You have many enemies, and little time to rest easy."],
      ["Magical Power", "Power. Magic. Something beyond the pale. You possess this, and through it your very existence demands special treatment."],
      ["Blood Ties", "Regardless of what real power you might have, your heritage demands special treatment."],
      ["Military Might", "You posses military might, such that no one around you would dare oppose you."],
      ["Assets", "It is the fortune you've amassed that gives you your power."],
      ["Political Power", "As the leader of an organization you have the power to command many people."],
      ["Mansion", "The true value lies not in you yourself, but in the mansion where you live. Perhaps some unimaginable technology or wealth sleeps there."],
      ["Talent", "You have a great talent in some particular area, or perhaps you're an all-around genius. Your prowess here is such that all must prostrate themselves before you."],
      ["Renown", "You are respected by all. You might a great hero, an enemy of all things evil."],
      ["Popularity", "You have something that people find irresistible, something worthy of a king. That is why the maids serve you."]
    ],
    "traumas" : [ "Former delinquent", "Former juvenile vagrant", "Former prostitute", "Social stigma", "Knows no love",
                 "In love with brother/cousin", "Broken by training", "Miscarriage", "History of suicide attempts",
                 "Horrible accident (car, fall, etc)", "Kidnapped", "Assaulted", "Mistreated by parents", "Arrested on false charges",
                 "Targeted by a stalker", "Betrayed by close friend", "Killed a close friend", "Betrayed a close friend",
                 "Parents disappeared", "Witnessed parents' death", "Parents tried to kill you", "Attacked by parents",
                 "Ran away from home", "Killed your parents", "Bad unrequited love", "Lover died", "Lover tried to kill you",
                 "Betrayed by lover", "Killed your lover", "Major failure", "Family breakup", "Took part in something bad",
                 "Wanted by the police", "Burdened by strong regret", "Destroyed your homeland", "Killed many people"
    ]
  }
}